{
    "welcome": "Bienvenue sur mon site web !",
    "MaintPag": {
        "title": "Bienvenue sur mon site web !",
        "content": "Ceci est la page d'accueil.",
        "heroMaint": "Ce site sera bientôt disponible",
        "herotitre": "Junior React & Laravel développeur",
        "herotext": "Je conçois des sites web sur-mesure, épurés et rapides, pensés pour <b>les artisans</b>, <b>indépendants</b> et <b>petites structures</b>. Mon approche ? Un design clair, sans superflu, qui met en <b>valeur</b> l’essentiel á votre activité.",
        "herobtn": "On en parle ?"
    },
    "home": {
        "title": "Bienvenue sur mon site web !",
        "content": "Ceci est la page d'accueil.",
        "herotitre": "Junior React & Laravel développeur",
        "herotext": "Une idée en tête, un projet en cours ou un site à améliorer ? Je suis développeur junior React et Laravel, prêt à relever de nouveaux défis, apprendre rapidement et créer des solutions performantes. Parlons-en et voyons ce que nous pouvons construire ensemble !",
        "herobtn": "On en parle ?"
    },
    "about": {
        "title": "aurelienj.",
        "content": "Ma fascination pour le web a commencé à l'adolescence. Je passais des heures à expérimenter avec HTML et CSS, en créant des blogs personnels et des sites web pour mes proches, ainsi que quelques projets communautaires locaux. Au fil du temps, j'ai découvert à quel point il était gratifiant de transformer des idées en expériences web fonctionnelles et esthétiques. Plus tard, alors que je travaillais dans un magasin de vélos, j'ai créé un site pour la boutique — un projet décisif qui a ravivé ma passion et m'a montré l'impact concret d'un bon développement web. Après dix belles années comme mécanicien vélo, j'ai décidé de faire le grand saut et de transformer cette passion en métier. Je me suis plongé dans l'apprentissage de React et Laravel, en développant des projets, en collaborant avec d'autres développeurs, et en améliorant sans cesse mes compétences. Aujourd'hui, je suis enthousiaste à l'idée de relever de nouveaux défis et de contribuer à des solutions web utiles en tant que développeur junior."
    },
    "contact": {
        "title": "Nous Contacter",
        "text": "Vous cherchez à recruter un développeur junior React et Laravel ? Entrons en contact et explorons comment je peux contribuer à votre équipe."
    },
    "UiUxLab": {
        "title": "Mes projets",
        "subTitle": "Expériences numériques et solutions interactives",
        "content": "Une vitrine de mes créations numériques, développées avec React, Vite et Tailwind CSS. Je mets l'accent sur un design épuré et une fonctionnalité efficace pour créer des expériences utilisateur intuitives et engageantes.",
        "p99": "BIENTÔT DISPONIBLE",
        "p98": "Le prochain projet est en cours de construction et sera bientôt disponible",
        "p11": "Nouvelle tache ...",
        "p12": "Liste de tâches",
        "p13": "Profitez de cette mini-application",
        "p14": "Liste de tâches interactive",
        "p15": "Une to-do list intuitive et fluide, conçue pour démontrer mes compétences en développement. Ajoutez, validez ou supprimez vos tâches facilement grâce à une interface réactive et dynamique.",
        "p21": "Smooth Login",
        "p22": "Un système de connexion rapide et intuitif, avec un champ unique et des animations fluides pour une expérience moderne et efficace",
        "p24": "Login",
        "p25": "Nom d'utilisateur",
        "p26": "Mot de Passe",
        "p31": "Flow Input Sending",
        "p32": "Une zone de saisie intuitive accompagnée d’un bouton d’envoi fluide, pensée pour offrir une expérience utilisateur rapide et élégante.",
        "p33": "Votre texte",
        "p34": "Envoyé",
        "p35": "Envoi en cours...",
        "p36": "Envoi réussi!",
        "p41": "Jeu de mémoire",
        "p42": "Jeu de mémoire mini : retrouvez toutes les paires correspondantes et mettez votre mémoire à l’épreuve. Envie d’un défi plus corsé ? La version complète propose trois niveaux de difficulté, facile pour un échauffement tranquille, normal pour maintenir la concentration, et difficile pour repousser les limites de votre mémoire. Suivez le lien pour découvrir toutes les variantes et tester votre esprit",
        "p43": "Jeu complet",
        "p51": "Frontend css ART challenge",
        "p52": "Ce projet est ma contribution au défi CSS Art : Culture de bureau, dans le cadre du Frontend Challenge : Édition Bureau, sponsorisé par Axero. Il réinvente la vie de bureau à bord de la Station Spatiale Internationale, en mêlant esthétique de science-fiction et interactivité professionnelle.",
        "p53": "Live preview",
        "p54": "Github Projet",
        "p55": "Challenge lien",
        "p61": "Weather Forecast App",
        "p62": "Une application web légère et réactive de prévision météorologique, développée avec React pour le front-end et Laravel pour le back-end. Elle offre aux utilisateurs des mises à jour météorologiques en temps réel ainsi que des prévisions localisées, en intégrant des données provenant d'API publiques fiables",
        "p63": "Live preview",
        "p64": "Github Projet"
    },
    "tasks": [
        { "id": 1, "text": "Optimiser une fonction existante", "checked": true },
        { "id": 2, "text": "Réviser React + Vite", "checked": false },
        { "id": 3, "text": "Refaire un ancien projet", "checked": false }

    ],
    "notfound": {
        "title": "404 - Page non trouvée",
        "content": "La page que vous recherchez n'existe pas."
    },
    "link": {
        "home": "Accueil",
        "about": "Moi?",
        "contact": "Contact",
        "UiUxLab": "Projets",
        "PP": "Politique de confidentialité",
        "LN": "Mentions légales"
    },
    "footer": {
        "title": "Demandez votre devis personnalisé",
        "subtitle": "Entrez votre email et recevez une proposition adaptée à vos besoins.",
        "note": "C’est 100% gratuit et sans aucun engagement."
    },
    "404": {
        "title": "Oups !",
        "heading": "404 - Page non trouvée",
        "message": "La page que vous recherchez a peut-être été supprimée, renommée ou est temporairement indisponible.",
        "button": "Retour à l’accueil"
    },
    "form": {
        "name": "Votre nom",
        "mail": "Votre Email",
        "url": "www.votre-siteweb.ch",
        "textarea": "Votre message",
        "button": "Envoyer",
        "loading": "Envoi en cours...",
        "emailValid": "Votre demande a bien été envoyée !",
        "emailError": "Une erreur s'est produite.",
        "invalidName": "Veuillez entrer un nom valide.",
        "invalidEmail": "Veuillez entrer un email valide.",
        "invalidUrl": "Veuillez entrer une adresse URL valide.",
        "emptyText": "Le message est obligatoire."
    }
}