{
    "welcome": "Welcome to my website!",
    "MaintPag": {
        "title": "Welcome to my website!",
        "content": "This is the home page.",
        "heroMaint": "We're Working On It",
        "herotitre": "Junior React & Developer",
        "herotext": "I'm passionate about crafting dynamic, responsive web applications with React and Laravel. Whether it's a sleek frontend or powerful backend, I love bringing ideas to life with clean code and thoughtful design. I'm currently open to new opportunities and eager to grow within a talented team.",
        "herobtn": "Let’s connect."
    },
    "home": {
        "title": "Welcome to my website!",
        "content": "This is the home page.",
        "herotitre": "Junior React & Laravel Developer",
        "herotext": "I'm passionate about crafting dynamic, responsive web applications with React and Laravel. Whether it's a sleek frontend or powerful backend, I love bringing ideas to life with clean code and thoughtful design. I'm currently open to new opportunities and eager to grow within a talented team.",
        "herobtn": "Let’s connect."
    },
    "about": {
        "title": "aurelienj.",
       "content": "My fascination with the web began in my teenage years. I spent hours experimenting with HTML and CSS, creating personal blogs and websites for friends, family, and even a few local community projects. Over time, I discovered how fulfilling it was to turn ideas into functional, visually pleasing web experiences. Later, while working at a bike shop, I built a website for the store — a pivotal project that reignited my passion and showed me the real-world impact of good web development. After ten rewarding years as a bicycle mechanic, I took a leap of faith to turn that passion into a profession. I immersed myself in learning React and Laravel, building projects, collaborating with peers, and constantly refining my skills. Today, I'm excited to take on new challenges and contribute to meaningful web solutions as a junior developer."
    },
    "contact": {
        "title": "Contact Me",
        "text": "Interested in hiring a junior React and Laravel developer? Let's connect and explore how I can contribute to your team."
    },
    "UiUxLab": {
        "title": "My projects",
        "subTitle": "Digital Experiences & Interactive Solutions",
        "content": "A showcase of my digital creations, built with React, Vite, and Tailwind CSS. I focus on combining clean design and efficient functionality to create intuitive and engaging user experiences",
        "p99": "COMING SOON",
        "p98": "The next project is under construction and will be available soon",
        "p11": "New task ...",
        "p12": "To-Do list",
        "p13": "Enjoy this mini-app",
        "p14": "Interactive To-Do List",
        "p15": "An intuitive and fluid to-do list designed to showcase my development skills. Easily add, validate, or delete tasks with a responsive and dynamic interface.",
        "p21": "Smooth Login",
        "p22": "A fast and intuitive login system with a single field and smooth animations for a modern, efficient experience",
        "p24": "Login",
        "p25": "Username",
        "p26": "Password",
        "p31": "Flow Input Sending",
        "p32": "An intuitive input field paired with a smooth send button, designed to provide a fast and elegant user experience",
        "p33": "Your Input",
        "p34": "Send",
        "p35": "Sending...",
        "p36": "Send successful!",
        "p41": "Memory Game",
        "p42": "Mini memory game: find all the matching pairs and put your brain to the test. If you're craving more of a challenge, the full version offers three progressively tougher levels, easy for a relaxed warm-up, normal to keep you thinking, and hard to push your memory to its limits. Follow the link to explore them all and see how far your concentration can take you.",
        "p43": "Full game",
        "p51": "Frontend css ART challenge",
        "p52": "This project is my submission for the CSS Art: Office Culture prompt in the Frontend Challenge: Office Edition, sponsored by Axero. It reimagines office life aboard the International Space Station, blending sci-fi aesthetics with workplace interactivity.",
        "p53": "Live preview",
        "p54": "Github Project",
        "p55": "Challenge link",
        "p61": "Weather Forecast App",
        "p62": "A lightweight and responsive weather forecasting web application developed using React for the front-end and Laravel for the back-end. It provides users with real-time weather updates and location-based forecasts by integrating data from trusted public APIs.",
        "p63": "Live preview",
        "p64": "Github Projet"
        
    },
    "tasks": [
        { "id": 1, "text": "Optimize an existing function", "checked": true },
        { "id": 2, "text": "Review React + Vite", "checked": false },
        { "id": 3, "text": "Redo an old project", "checked": false }

    ],
    "notfound": {
        "title": "404 - Page Not Found",
        "content": "The page you are looking for does not exist."
    },
    "link": {
        "home": "Home",
        "about": "Me?",
        "contact": "Contact",
        "UiUxLab": "Projects",
        "PP": "Privacy Policy",
        "LN": "Legal Notice"
    },
    "footer": {
        "title": "Request Your Personalized Quote",
        "subtitle": "Enter your email and receive a proposal tailored to your needs.",
        "note": " It’s completely free with no obligation whatsoever.",
        "mail": "Your Email",
        "button": "Send",
        "loading": "Sending...",
        "emailValid": "Your request has been sent!",
        "emailError": "An error occurred.",
        "invalidEmail": "Please enter a valid email address."
    },
    "404": {
        "title": "Oops!",
        "heading": "404 - Page Not Found",
        "message": "The page you are looking for might have been removed, had its name changed, or is temporarily unavailable.",
        "button": "Go to Homepage"
    },
    "form": {
        "name": "Your name",
        "mail": "Your Email",
        "url": "www.your-website.com",
        "textarea": "Your message",
        "button": "Send",
        "loading": "Sending...",
        "emailValid": "Your request has been sent!",
        "emailError": "An error occurred.",
        "invalidName": "Please enter a valid name.",
        "invalidEmail": "Please enter a valid email address.",
        "invalidUrl": "Please enter a valid URL address.",
        "emptyText": "Message is obligatoire."
    }
}